[
  {
    "id": 1,
    "data": {
      "title": "Keeping API Server Alive",
      "date": "2024-07-19T00:00:00.000Z"
    },
    "content": "\n## Introduction\n\nDuring the backend portion of my Northcoders bootcamp, I created an API server using Render's free service. While this service is cost-effective, it has a downside: if the server remains unused for a while, it goes to sleep. This can lead to excessive or infinite load times when showcasing the project on a portfolio, which is not ideal for a good user experience. To solve this issue, I devised a method to keep the server alive, ensuring quick response times. I thought I'd share this solution for anyone facing a similar problem.\n\n## Solution Steps\n\n1. **Create an AWS Account**:\n    \n    - Sign up for an account on [AWS (Amazon Web Services)](https://aws.amazon.com/). You will need to provide card details, but you won't be charged as long as you stay within the free tier limits. Check AWS pricing to confirm, or consider alternative services if needed.\n2. **Navigate to AWS Lambda**:\n    \n    - Use the search bar to find and select \"Lambda\" from the AWS services.\n3. **Create a Lambda Function**:\n    \n    - **Name**: Choose a name for your function (e.g., `keepAlivePing`).\n    - **Runtime**: Select Node.js (choose the latest version available).\n    - **Role**: Create a new role with basic Lambda permissions.\n    - Click on \"Create function\" to deploy.\n4. **Write the Lambda Function**:\n    \n    - You can write your own function or use the one I have provided in this [GitHub repository](https://github.com/Burnlees/server-pinger/blob/main/apiServerPing.js). Copy and paste the code, replacing the placeholder URL with your API endpoint.\n5. **Navigate to Amazon EventBridge Scheduler**:\n    \n    - Search for \"EventBridge Scheduler\" using the AWS search bar.\n6. **Create a Schedule**:\n    \n    - Click on \"Create schedule\".\n    - **Name**: Give your schedule a descriptive name.\n    - **Occurrence**: Choose \"Recurring Schedule\".\n    - **Schedule Type**: Select \"Rate-based Schedule\".\n    - **Rate Expression**: I recommend using a 1-minute interval, though less frequent intervals may also work.\n    - **Flexible Timeframe**: Set this to 5 minutes.\n7. **Configure the Schedule**:\n    \n    - Click \"Next\".\n    - On the following page, select \"Lambda Invoke\".\n    - Choose your Lambda function from the dropdown menu.\n8. **Finalize the Schedule**:\n    \n    - Click \"Next\" and then \"Create schedule\" to finalize.\n\n## Monitoring\n\nYou can monitor the execution of your Lambda function by checking the logs in the CloudWatch section of AWS. Allow some time for the function to run before reviewing the logs.\n\nBy following these steps, you can keep your API server active, ensuring it remains responsive for portfolio viewers."
  }
]